openfoam/cylinder_with_interfaces/0.orig/bottom_fluid/T
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 300;

boundaryField
{
    walls
    {
        type            zeroGradient;
    }
    
    bottom_inlet
    {
        type            fixedValue;
        value           uniform 300;
    }
    
    bottom_outlet
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }
    
    bottom_fluid_to_slab
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           uniform 300;
    }
}
