openfoam/cylinder_with_interfaces/0.orig/bottom_fluid/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    walls
    {
        type            noSlip;
    }
    
    bottom_inlet
    {
        type            fixedValue;
        value           uniform (0 0 -0.1);
    }
    
    bottom_outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    bottom_fluid_to_slab
    {
        type            noSlip;
    }
}
