openfoam/cylinder_with_interfaces/0.orig/slab/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    walls
    {
        type            calculated;
        value           uniform 0;
    }
    
    slab_to_top_fluid
    {
        type            calculated;
        value           uniform 0;
    }
    
    slab_to_bottom_fluid
    {
        type            calculated;
        value           uniform 0;
    }
}
