openfoam/cylinder_with_interfaces/0.orig/top_fluid/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 101325;

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    
    top_inlet
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
    
    top_outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    
    top_fluid_to_slab
    {
        type            fixedFluxPressure;
        value           uniform 101325;
    }
}
