openfoam/cylinder_with_interfaces/constant/slab/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/slab/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            patch;
        physicalType    patch;
        nFaces          1370;
        startFace       29843;
    }
    slab_to_top_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          5288;
        startFace       31213;
        sampleMode      nearestPatchFace;
        sampleRegion    top_fluid;
        samplePatch     top_fluid_to_slab;
    }
    slab_to_bottom_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          5288;
        startFace       36501;
        sampleMode      nearestPatchFace;
        sampleRegion    bottom_fluid;
        samplePatch     bottom_fluid_to_slab;
    }
)

// ************************************************************************* //
