openfoam/cylinder_with_interfaces/constant/slab/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heSolidThermo;
    mixture         pureMixture;
    transport       constIso;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   50;
    }
    equationOfState
    {
        rho         8000;
    }
    thermodynamics
    {
        Cp          500;
        Hf          0;
        Tref        298;

    }
    transport
    {
        kappa       45;
    }
}
