openfoam/cylinder_with_interfaces/constant/top_fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/top_fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            patch;
        physicalType    patch;
        nFaces          5766;
        startFace       170997;
    }
    top_outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          644;
        startFace       176763;
    }
    top_inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          624;
        startFace       177407;
    }
    top_fluid_to_slab
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          5288;
        startFace       178031;
        sampleMode      nearestPatchFace;
        sampleRegion    slab;
        samplePatch     slab_to_top_fluid;
    }
)

// ************************************************************************* //
