openfoam/cylinder_with_interfaces/constant/top_fluid/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState rhoConst;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight   18.0;
    }
    equationOfState
    {
        rho         1000;
    }
    thermodynamics
    {
        Cp          4182;
        Tref        298;
        Hf          0;
    }
    transport
    {
        mu          1e-3;
        Pr          7;
    }
}
